nmaas87/arduino-to-xmc/trunk/hardware/xmc/cores/XMC1100/GPIO.h
__STATIC_INLINE void P2_9_set_mode(uint8_t mode){
    PORT2->IOCR8 &= ~0x0000f800UL;
    PORT2->IOCR8 |= mode << 8;
}

__STATIC_INLINE void P2_9_set_hwsel(uint32_t config){
    PORT2->HWSEL &= ~0x000c0000UL;
    PORT2->HWSEL |= config << 18;
}

__STATIC_INLINE void P2_9_set_standard_hysteresis(){
    PORT2->PHCR1 &= ~0x00000040UL;
}

__STATIC_INLINE void P2_9_set_large_hysteresis(){
    PORT2->PHCR1 |= 0x00000040UL;
}

__STATIC_INLINE void P2_9_enable_digital(void){
    PORT2->PDISC &= ~0x00000200UL;
}

__STATIC_INLINE void P2_9_disable_digital(void){
    PORT2->PDISC |= 0x00000200UL;
}

__STATIC_INLINE void P2_9_set(void){
    PORT2->OMR = 0x00000200UL;
}

__STATIC_INLINE void P2_9_reset(void){
    PORT2->OMR = 0x02000000UL;
}

__STATIC_INLINE void P2_9_toggle(void){
    PORT2->OMR = 0x02000200UL;
}

__STATIC_INLINE uint32_t P2_9_read(void){
    return(PORT2->IN & 0x00000200UL);
}

__STATIC_INLINE void P2_9_enable_pps(void){
    PORT2->PPS |= 0x00000200UL;
}

__STATIC_INLINE void P2_9_disable_pps(void){
    PORT2->PPS &= ~0x00000200UL;
}

__STATIC_INLINE void P2_10_set_mode(uint8_t mode){
    PORT2->IOCR8 &= ~0x00f80000UL;
    PORT2->IOCR8 |= mode << 16;
}

__STATIC_INLINE void P2_10_set_hwsel(uint32_t config){
    PORT2->HWSEL &= ~0x00300000UL;
    PORT2->HWSEL |= config << 20;
}

__STATIC_INLINE void P2_10_set_standard_hysteresis(){
    PORT2->PHCR1 &= ~0x00000400UL;
}

__STATIC_INLINE void P2_10_set_large_hysteresis(){
    PORT2->PHCR1 |= 0x00000400UL;
}

__STATIC_INLINE void P2_10_enable_digital(void){
    PORT2->PDISC &= ~0x00000400UL;
}

__STATIC_INLINE void P2_10_disable_digital(void){
    PORT2->PDISC |= 0x00000400UL;
}

__STATIC_INLINE void P2_10_set(void){
    PORT2->OMR = 0x00000400UL;
}

__STATIC_INLINE void P2_10_reset(void){
    PORT2->OMR = 0x04000000UL;
}

__STATIC_INLINE void P2_10_toggle(void){
    PORT2->OMR = 0x04000400UL;
}

__STATIC_INLINE uint32_t P2_10_read(void){
    return(PORT2->IN & 0x00000400UL);
}

__STATIC_INLINE void P2_10_enable_pps(void){
    PORT2->PPS |= 0x00000400UL;
}

__STATIC_INLINE void P2_10_disable_pps(void){
    PORT2->PPS &= ~0x00000400UL;
}

__STATIC_INLINE void P2_11_set_mode(uint8_t mode){
    PORT2->IOCR8 &= ~0xf8000000UL;
    PORT2->IOCR8 |= mode << 24;
}

__STATIC_INLINE void P2_11_set_hwsel(uint32_t config){
    PORT2->HWSEL &= ~0x00c00000UL;
    PORT2->HWSEL |= config << 22;
}

__STATIC_INLINE void P2_11_set_standard_hysteresis(){
    PORT2->PHCR1 &= ~0x00004000UL;
}

__STATIC_INLINE void P2_11_set_large_hysteresis(){
    PORT2->PHCR1 |= 0x00004000UL;
}

__STATIC_INLINE void P2_11_enable_digital(void){
    PORT2->PDISC &= ~0x00000800UL;
}

__STATIC_INLINE void P2_11_disable_digital(void){
    PORT2->PDISC |= 0x00000800UL;
}

__STATIC_INLINE void P2_11_set(void){
    PORT2->OMR = 0x00000800UL;
}

__STATIC_INLINE void P2_11_reset(void){
    PORT2->OMR = 0x08000000UL;
}

__STATIC_INLINE void P2_11_toggle(void){
    PORT2->OMR = 0x08000800UL;
}

__STATIC_INLINE uint32_t P2_11_read(void){
    return(PORT2->IN & 0x00000800UL);
}

__STATIC_INLINE void P2_11_enable_pps(void){
    PORT2->PPS |= 0x00000800UL;
}

__STATIC_INLINE void P2_11_disable_pps(void){
    PORT2->PPS &= ~0x00000800UL;
}

#endif
